load-tests/test-results.txt

started at  01:25
k6 run -e RPS=50 -e VUS=5  load-tests/baseline-smoke-test.js


 █ TOTAL RESULTS

    checks_total.......................: 14865   41.350942/s
    checks_succeeded...................: 100.00% 14865 out of 14865
    checks_failed......................: 0.00%   0 out of 14865

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=59.98ms min=3.68ms med=14.5ms  max=4.31s p(90)=72.81ms p(95)=131.13ms
      { expected_response:true }............................................: avg=59.98ms min=3.68ms med=14.5ms  max=4.31s p(90)=72.81ms p(95)=131.13ms
    http_req_failed.........................................................: 0.00%  0 out of 14865
    http_reqs...............................................................: 14865  41.350942/s

    EXECUTION
    dropped_iterations......................................................: 135    0.375538/s
    iteration_duration......................................................: avg=60.45ms min=3.92ms med=14.93ms max=4.31s p(90)=73.27ms p(95)=131.56ms
    iterations..............................................................: 14865  41.350942/s
    vus.....................................................................: 0      min=0          max=107
    vus_max.................................................................: 112    min=9          max=112

    NETWORK
    data_received...........................................................: 10 MB  29 kB/s
    data_sent...............................................................: 6.2 MB 17 kB/s



running (5m59.5s), 000/112 VUs, 14865 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 000/112 VUs  5m0s  50.00 iters/s


01:30 completed

01:31 started


k6 run -e RPS=100 -e VUS=5  load-tests/baseline-smoke-test.js


 █ TOTAL RESULTS

    checks_total.......................: 29799   63.84602/s
    checks_succeeded...................: 100.00% 29799 out of 29799
    checks_failed......................: 0.00%   0 out of 29799

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=74.55ms min=3.25ms med=25.79ms max=2m49s p(90)=113.19ms p(95)=185.77ms
      { expected_response:true }............................................: avg=74.55ms min=3.25ms med=25.79ms max=2m49s p(90)=113.19ms p(95)=185.77ms
    http_req_failed.........................................................: 0.00% 0 out of 29799
    http_reqs...............................................................: 29799 63.84602/s

    EXECUTION
    dropped_iterations......................................................: 202   0.432796/s
    iteration_duration......................................................: avg=63.79ms min=3.42ms med=26.21ms max=3.2s  p(90)=113.62ms p(95)=186.28ms
    iterations..............................................................: 29799 63.84602/s
    vus.....................................................................: 5     min=1          max=138
    vus_max.................................................................: 158   min=8          max=158

    NETWORK
    data_received...........................................................: 21 MB 44 kB/s
    data_sent...............................................................: 12 MB 27 kB/s



01:37 completed


01:42 starting
k6 run -e RPS=150 -e VUS=5  load-tests/baseline-smoke-test.js

     execution: local
        script: load-tests/baseline-smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 5m30s max duration (incl. graceful stop):
              * constant_request_rate: 150.00 iterations/s for 5m0s (maxVUs: 5-300, gracefulStop: 30s)

WARN[0295] Request Failed                                error="Post \"http://localhost:8081/payments\": EOF"
ERRO[0295] Request failed: 0 - null                      source=console
WARN[0295] Request Failed                                error="Post \"http://localhost:8081/payments\": EOF"
ERRO[0295] Request failed: 0 - null                      source=console


  █ TOTAL RESULTS

    checks_total.......................: 44588  62.870335/s
    checks_succeeded...................: 99.99% 44586 out of 44588
    checks_failed......................: 0.00%  2 out of 44588

    ✗ status is 200
      ↳  99% — ✓ 44586 / ✗ 2

    HTTP
    http_req_duration.......................................................: avg=83.06ms min=1.5ms  med=22.83ms max=6m52s p(90)=102.73ms p(95)=174.83ms
      { expected_response:true }............................................: avg=83.06ms min=2.88ms med=22.83ms max=6m52s p(90)=102.73ms p(95)=174.83ms
    http_req_failed.........................................................: 0.00% 2 out of 44588
    http_reqs...............................................................: 44588 62.870335/s

    EXECUTION
    dropped_iterations......................................................: 412   0.580932/s
    iteration_duration......................................................: avg=65.16ms min=3.03ms med=23.22ms max=4.65s p(90)=103.1ms  p(95)=175.06ms
    iterations..............................................................: 44588 62.870335/s
    vus.....................................................................: 1     min=0          max=243
    vus_max.................................................................: 258   min=21         max=258

    NETWORK
    data_received...........................................................: 31 MB 44 kB/s
    data_sent...............................................................: 19 MB 26 kB/s



increased Postgre max connection from 100 to 120

hikari active connections from 70 to 90



03:49 starting

k6 run -e RPS=150 -e VUS=5  load-tests/baseline-smoke-test.js



         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: load-tests/baseline-smoke-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 5m30s max duration (incl. graceful stop):
              * constant_request_rate: 150.00 iterations/s for 5m0s (maxVUs: 5-300, gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......................: 44816   149.36291/s
    checks_succeeded...................: 100.00% 44816 out of 44816
    checks_failed......................: 0.00%   0 out of 44816

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=156.88ms min=6.88ms med=82.27ms max=2.64s p(90)=360.73ms p(95)=581.26ms
      { expected_response:true }............................................: avg=156.88ms min=6.88ms med=82.27ms max=2.64s p(90)=360.73ms p(95)=581.26ms
    http_req_failed.........................................................: 0.00% 0 out of 44816
    http_reqs...............................................................: 44816 149.36291/s

    EXECUTION
    dropped_iterations......................................................: 184   0.613236/s
    iteration_duration......................................................: avg=157.3ms  min=7.19ms med=82.66ms max=2.64s p(90)=361.16ms p(95)=581.83ms
    iterations..............................................................: 44816 149.36291/s
    vus.....................................................................: 11    min=2          max=163
    vus_max.................................................................: 183   min=66         max=183

    NETWORK
    data_received...........................................................: 31 MB 104 kB/s
    data_sent...............................................................: 19 MB 62 kB/s



running (5m00.0s), 000/183 VUs, 44816 complete and 0 interrupted iterations


private const val THREAD_COUNT = 4   // was 8
private const val BATCH_SIZE  = 500 // consolidate work
@Scheduled(fixedDelay = 5_000)       //
was 3 000

04:10  started
     scenarios: (100.00%) 1 scenario, 300 max VUs, 5m30s max duration (incl. graceful stop):
              * constant_request_rate: 150.00 iterations/s for 5m0s (maxVUs: 5-300, gracefulStop: 30s)



  █ TOTAL RESULTS

    checks_total.......................: 44901   149.601456/s
    checks_succeeded...................: 100.00% 44901 out of 44901
    checks_failed......................: 0.00%   0 out of 44901

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=66.4ms  min=3.47ms med=35.22ms max=1.66s p(90)=143.97ms p(95)=224.48ms
      { expected_response:true }............................................: avg=66.4ms  min=3.47ms med=35.22ms max=1.66s p(90)=143.97ms p(95)=224.48ms
    http_req_failed.........................................................: 0.00% 0 out of 44901
    http_reqs...............................................................: 44901 149.601456/s

    EXECUTION
    dropped_iterations......................................................: 100   0.333181/s
    iteration_duration......................................................: avg=66.75ms min=3.64ms med=35.57ms max=1.66s p(90)=144.3ms  p(95)=    iteration_duration......................................................: avg=66.75ms min=3.64ms med=35.57ms max=1.66s p(90)=144.3ms  p(95)=225.04ms
225.04ms
    iterations..............................................................: 44901 149.601456/s
    vus.....................................................................: 8     min=1          max=97
    vus_max.................................................................: 103   min=63         max=103

    NETWORK
    data_received...........................................................: 31 MB 104 kB/s
    data_sent...............................................................: 19 MB 62 kB/s



running (5m00.1s), 000/103 VUs, 44901 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 000/103 VUs  5m0s  150.00 iters/s


decerasing hikari.connectiontomeout to 1s


04-24
 k6 run -e RPS=150 -e VUS=5  load-tests/baseline-smoke-test.js



ERRO[0025] Request failed: 500 - {"timestamp":"2025-06-20T02:25:22.928413136Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"7760cede-2432-471a-8c40-830bdc70cc38"}  source=console
ERRO[0025] Request failed: 500 - {"timestamp":"2025-06-20T02:25:22.939405427Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"795efcbf-9ee2-4c19-af96-8c14137e08db"}  source=console
ERRO[0025] Request failed: 500 - {"timestamp":"2025-06-20T02:25:22.946169177Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"8e2fb61d-9020-4b55-a736-d32393b05339"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:23.181163636Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"66d36688-3f04-4f65-bc4d-a20a06e3ae34"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:23.226172803Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"69d84ade-9fe3-4106-9fdf-51243d84ce89"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:22.879032719Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"3cd74f80-8162-416f-a035-5f461c56dc3a"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:23.259227844Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"eeed404e-1b34-48a0-afd2-618ebc506532"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:23.395813844Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"7465e392-09ff-4816-80ff-8a24369cadf6"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:23.286881344Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"7266a9e7-6507-4a0e-ae20-c0951290af9f"}  source=console
ERRO[0026] Request failed: 500 - {"timestamp":"2025-06-20T02:25:23.394422761Z","status":500,"error":"Internal Server Error","message":"Could not open JPA EntityManager for transaction","path":"/payments","traceId":"72fcc30b-ed2b-44ac-a4d7-14f2df566cae"}  source=console


  █ TOTAL RESULTS

    checks_total.......................: 44697  148.961774/s
    checks_succeeded...................: 98.81% 44169 out of 44697
    checks_failed......................: 1.18%  528 out of 44697

    ✗ status is 200
      ↳  98% — ✓ 44169 / ✗ 528

    HTTP
    http_req_duration.......................................................: avg=214.71ms min=3.32ms med=58.39ms max=5.02s p(90)=579.95ms p(95)=1.15s
      { expected_response:true }............................................: avg=195.14ms min=3.32ms med=57.53ms max=5.02s p(90)=501.27ms p(95)=991.81ms
    http_req_failed.........................................................: 1.18% 528 out of 44697
    http_reqs...............................................................: 44697 148.961774/s

    EXECUTION
    dropped_iterations......................................................: 304   1.013141/s
    iteration_duration......................................................: avg=215.12ms min=3.45ms med=58.79ms max=5.02s p(90)=580.34ms p(95)=1.15s
    iterations..............................................................: 44697 148.961774/s
    vus.....................................................................: 12    min=1            max=299
    vus_max.................................................................: 300   min=77           max=300

    NETWORK
    data_received...........................................................: 31 MB 103 kB/s
    data_sent...............................................................: 19 MB 62 kB/s


set connect timeout back to 3s


changed threadcount in outboxdispatcher
private const val THREAD_COUNT = 6

started at 04:46



  █ TOTAL RESULTS

    checks_total.......................: 43986  146.573819/s
    checks_succeeded...................: 99.59% 43808 out of 43986
    checks_failed......................: 0.40%  178 out of 43986

    ✗ status is 200
      ↳  99% — ✓ 43808 / ✗ 178

    HTTP
    http_req_duration.......................................................: avg=411.39ms min=8.67ms med=163.39ms max=8.1s p(90)=1.06s p(95)=1.58s
      { expected_response:true }............................................: avg=395.11ms min=8.67ms med=162.26ms max=8.1s p(90)=1.04s p(95)=1.52s
    http_req_failed.........................................................: 0.40% 178 out of 43986
    http_reqs...............................................................: 43986 146.573819/s

    EXECUTION
    dropped_iterations......................................................: 1015  3.382268/s
    iteration_duration......................................................: avg=411.82ms min=9.02ms med=163.81ms max=8.1s p(90)=1.06s p(95)=1.58s
    iterations..............................................................: 43986 146.573819/s
    vus.....................................................................: 5     min=2            max=300
    vus_max.................................................................: 300   min=77           max=300

    NETWORK
    data_received...........................................................: 31 MB 102 kB/s
    data_sent...............................................................: 18 MB 61 kB/s



increase @Scheduled(fixedDelay = 5_000) to 10_00

started  04:%7